In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('nyc_weather.csv')

In [3]:
df

     date  temperature(F)
0   Jan 1              27
1   Jan 2              31
2   Jan 3              23
3   Jan 4              34
4   Jan 5              37
5   Jan 6              38
6   Jan 7              29
7   Jan 8              30
8   Jan 9              35
9  Jan 10              30

In [4]:
# df = pd.read_excel('nyc_weather.csv', 'Sheet1')

In [5]:
weather_data = {
    'day': ['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017'],
    'temperature': [32, 35, 28, 24, 32, 31],
    'windspeed': [6, 7, 2, 7, 4, 2],
    'event': ['Rain', 'Sunny', 'Snow', 'Snow', 'Rain', 'Sunny']
}
df = pd.DataFrame(weather_data)

In [6]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [7]:
# using tuple list
weather = [
    ('1/1/2017', 32, 6, 'Rain'),
    ('1/2/2017', 35, 7, 'Sunny'),
    ('1/3/2017', 28, 2, 'Snow')
]
df = pd.DataFrame(weather, columns=['date', 'temperature', 'windspeed', 'event'])

In [8]:
df

       date  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

In [9]:
elements = [
        { 'name': 'vedanth',   'age': 17, 'time_hours': 1},
        { 'name': 'rajab', 'age': 12,  'time_hours': 3},
        { 'name': 'vignesh',  'age': 21,  'time_hours': 2.5},
        { 'name': 'chinmay',  'age': 24,  'time_hours': 1.5},
    ]
df = pd.DataFrame(elements)

In [10]:
df

      name  age  time_hours
0  vedanth   17         1.0
1    rajab   12         3.0
2  vignesh   21         2.5
3  chinmay   24         1.5

In [11]:
df[:][df['age'] > 20]

      name  age  time_hours
2  vignesh   21         2.5
3  chinmay   24         1.5

In [12]:
# pandas IO